INSA-GEI/insa-nxpcup/code/2025-2026/car_control_frdmmcxn236/board/pin_mux.h
/*! @name PORT1_5 (coord B3), CAM_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define SMARTDMACAMERAPINS_CAM_D1_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D1_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define SMARTDMACAMERAPINS_CAM_D1_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SMARTDMACAMERAPINS_CAM_D1_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D1_PIN 5U                   /*!<@brief PORT pin number */
#define SMARTDMACAMERAPINS_CAM_D1_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_4 (coord A4), CAM_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define SMARTDMACAMERAPINS_CAM_D0_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D0_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define SMARTDMACAMERAPINS_CAM_D0_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SMARTDMACAMERAPINS_CAM_D0_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_D0_PIN 4U                   /*!<@brief PORT pin number */
#define SMARTDMACAMERAPINS_CAM_D0_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_18 (coord G4), CAM_PDWN
  @{ */

/* Symbols to be used with GPIO driver */
#define SMARTDMACAMERAPINS_CAM_PDWN_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_PDWN_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define SMARTDMACAMERAPINS_CAM_PDWN_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define SMARTDMACAMERAPINS_CAM_PDWN_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SMARTDMACAMERAPINS_CAM_PDWN_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_PDWN_PIN 18U                   /*!<@brief PORT pin number */
#define SMARTDMACAMERAPINS_CAM_PDWN_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_19 (coord G5), CAM_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define SMARTDMACAMERAPINS_CAM_RST_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_RST_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define SMARTDMACAMERAPINS_CAM_RST_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define SMARTDMACAMERAPINS_CAM_RST_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SMARTDMACAMERAPINS_CAM_RST_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define SMARTDMACAMERAPINS_CAM_RST_PIN 19U                   /*!<@brief PORT pin number */
#define SMARTDMACAMERAPINS_CAM_RST_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SmartDMACameraPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT1_3 (coord B4), PWM1
  @{ */

/* Symbols to be used with PORT driver */
#define PWM1_SERVO_PWM1_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define PWM1_SERVO_PWM1_PIN 3U                   /*!<@brief PORT pin number */
#define PWM1_SERVO_PWM1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT3_12 (coord G16), PWM2
  @{ */

/* Symbols to be used with PORT driver */
#define PWM1_SERVO_PWM2_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define PWM1_SERVO_PWM2_PIN 12U                   /*!<@brief PORT pin number */
#define PWM1_SERVO_PWM2_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PWM1_SERVO(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT4_6 (coord N7), T1
  @{ */

/* Symbols to be used with GPIO driver */
#define DEBUG_GPIO_T1_GPIO GPIO4               /*!<@brief GPIO peripheral base pointer */
#define DEBUG_GPIO_T1_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define DEBUG_GPIO_T1_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define DEBUG_GPIO_T1_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define DEBUG_GPIO_T1_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define DEBUG_GPIO_T1_PIN 6U                   /*!<@brief PORT pin number */
#define DEBUG_GPIO_T1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT4_15 (coord T8), T2
  @{ */

/* Symbols to be used with GPIO driver */
#define DEBUG_GPIO_T2_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define DEBUG_GPIO_T2_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define DEBUG_GPIO_T2_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define DEBUG_GPIO_T2_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define DEBUG_GPIO_T2_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define DEBUG_GPIO_T2_PIN 15U                   /*!<@brief PORT pin number */
#define DEBUG_GPIO_T2_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT4_16 (coord R8), T3
  @{ */

/* Symbols to be used with GPIO driver */
#define DEBUG_GPIO_T3_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define DEBUG_GPIO_T3_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define DEBUG_GPIO_T3_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define DEBUG_GPIO_T3_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define DEBUG_GPIO_T3_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define DEBUG_GPIO_T3_PIN 16U                   /*!<@brief PORT pin number */
#define DEBUG_GPIO_T3_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void DEBUG_GPIO(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
